
<a href='https://sites.google.com/site/jahangirypedram/'> <img src="logo.jpg" /></a>
___
## Pedram Jahangiry (Fall 2019)

# Introduction to Pandas

Topics to be covered:

1. Series
2. DataFrames
3. Missing Variables
4. Operations
5. Data import and export

Make sure you have access to the pandas cheatsheet provided in the course folder.

## 1. Series

Series are very similar to NumPy arrays. The difference is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. We can convert a list,numpy array, or dictionary to a Series.

In [9]:
import numpy as np
import pandas as pd

In [11]:
my_list = [1,2,3]
pd.Series(data=my_list)

0    1
1    2
2    3
dtype: int64

In [12]:
labels = ['a','b','c']
pd.Series(data=my_list,index=labels)

a    1
b    2
c    3
dtype: int64

In [13]:
my_array = np.array([1,2,3])
pd.Series(my_array)

0    1
1    2
2    3
dtype: int32

In [14]:
pd.Series(my_array,labels)

a    1
b    2
c    3
dtype: int32

In [16]:
my_dict = {'a':1,'b':2,'c':3}
pd.Series(my_dict)

a    1
b    2
c    3
dtype: int64

In [17]:
my_series = pd.Series(my_dict)

In [22]:
my_series[0]

1

In [19]:
my_series['b']

2

## 2. DataFrames

DataFrames are directly inspired by the R programming language and are the workhorse of pandas.

In [32]:
np.random.seed(100)  # do this if you want to see the same results as mine

In [83]:
df = pd.DataFrame(np.random.randn(4,4),index='A B C D'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A -0.531280  1.029733 -0.438136 -1.118318
B  1.618982  1.541605 -0.251879 -0.842436
C  0.184519  0.937082  0.731000  1.361556
D -0.326238  0.055676  0.222400 -1.443217

In [84]:
df.describe()

              W         X         Y         Z
count  4.000000  4.000000  4.000000  4.000000
mean   0.236495  0.891024  0.065846 -0.510604
std    0.969556  0.617096  0.523414  1.272030
min   -0.531280  0.055676 -0.438136 -1.443217
25%   -0.377499  0.716731 -0.298443 -1.199543
50%   -0.070860  0.983407 -0.014740 -0.980377
75%    0.543134  1.157701  0.349550 -0.291438
max    1.618982  1.541605  0.731000  1.361556

In [85]:
df.describe().transpose()

   count      mean       std       min       25%       50%       75%       max
W    4.0  0.236495  0.969556 -0.531280 -0.377499 -0.070860  0.543134  1.618982
X    4.0  0.891024  0.617096  0.055676  0.716731  0.983407  1.157701  1.541605
Y    4.0  0.065846  0.523414 -0.438136 -0.298443 -0.014740  0.349550  0.731000
Z    4.0 -0.510604  1.272030 -1.443217 -1.199543 -0.980377 -0.291438  1.361556

### Indexing and extraction

In [38]:
df['W']       # this is equivalent to df.W (which I don't recommend you to use it). == df$W in R

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
Name: W, dtype: float64

In [39]:
df[['W']]

          W
A -1.749765
B  0.981321
C -0.189496
D -0.583595

In [36]:
df[['W','Y']]

          W         Y
A -1.749765  1.153036
B  0.981321  0.221180
C -0.189496 -0.458027
D -0.583595  0.672721

In [55]:
df['new'] = df['W'] + df['Y']

In [56]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -0.596730
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126

In [47]:
df.drop('A',axis=0)

          W         X         Y         Z
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [43]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [44]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -0.596730
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126

In [45]:
df.drop('new',axis=1,inplace=True)    
# or alternatively use: df = df.drop('new', 1)

In [46]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [50]:
# we can select a row by calling its label or by select based off of its position instead of label 
df.loc['A']

W   -1.749765
X    0.342680
Y    1.153036
Z   -0.252436
Name: A, dtype: float64

In [52]:
df.iloc[0]

W   -1.749765
X    0.342680
Y    1.153036
Z   -0.252436
Name: A, dtype: float64

In [53]:
df.loc[['A','D'],['W','Z']]

          W         Z
A -1.749765 -0.252436
D -0.583595 -0.104411

### Conditional extraction
This is very similar to numpy conditional extraction

In [61]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [62]:
df>0

       W     X      Y      Z
A  False  True   True  False
B   True  True   True  False
C  False  True  False   True
D  False  True   True  False

In [63]:
df[df>0]

          W         X         Y         Z
A       NaN  0.342680  1.153036       NaN
B  0.981321  0.514219  0.221180       NaN
C       NaN  0.255001       NaN  0.435163
D       NaN  0.816847  0.672721       NaN

In [68]:
df[df['Y']>0]

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
D -0.583595  0.816847  0.672721 -0.104411

In [69]:
df[df['Y']>0]['X']

A    0.342680
B    0.514219
D    0.816847
Name: X, dtype: float64

In [71]:
df[df['Y']>0][['Y','Z']]

          Y         Z
A  1.153036 -0.252436
B  0.221180 -1.070043
D  0.672721 -0.104411

In [72]:
df[(df['Y']>0) & (df['Z'] < -0.5)]

          W         X        Y         Z
B  0.981321  0.514219  0.22118 -1.070043

## 3. Missing variables

In [159]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [160]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [12]:
df.dropna() # by default axis=0,   # this is similar to df[complete.cases(df),] in R

     A    B  C
0  1.0  5.0  1

In [78]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [80]:
df.dropna(thresh=2) # how many elements in an observation is NaN?

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [81]:
df.fillna(value='new value')

           A          B  C
0          1          5  1
1          2  new value  2
2  new value  new value  3

In [82]:
df['A'].fillna(value=df['A'].mean()) # filling the value with the mean of a column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64


## 4. Operations

In [167]:
df = pd.DataFrame({'names': 'PJ PJ TJ MJ'.split() ,
                   'GPA': [4,4,3.8,3.5]}, index='A B C D'.split())
df

  names  GPA
A    PJ  4.0
B    PJ  4.0
C    TJ  3.8
D    MJ  3.5

In [168]:
df.head(3)

  names  GPA
A    PJ  4.0
B    PJ  4.0
C    TJ  3.8

In [169]:
df.tail(1)

  names  GPA
D    MJ  3.5

In [170]:
# Unique Values
df['names'].unique()

array(['PJ', 'TJ', 'MJ'], dtype=object)

In [172]:
# number of unique values
df['GPA'].nunique()

3

In [173]:
df['names'].value_counts()

PJ    2
MJ    1
TJ    1
Name: names, dtype: int64

In [176]:
# Applying Functions
df['GPA'].mean()

3.825

In [179]:
round(df['GPA'].std(), 2)

0.24

In [183]:
df['GPA_100'] = df['GPA'].apply(lambda x: x*25)
df

  names  GPA  GPA_100
A    PJ  4.0    100.0
B    PJ  4.0    100.0
C    TJ  3.8     95.0
D    MJ  3.5     87.5

In [184]:
df.columns

Index(['names', 'GPA', 'GPA_100'], dtype='object')

In [185]:
df.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [186]:
df.sort_values(by='GPA') #inplace=False by default (what does this mean?)

  names  GPA  GPA_100
D    MJ  3.5     87.5
C    TJ  3.8     95.0
A    PJ  4.0    100.0
B    PJ  4.0    100.0

In [190]:
df.reset_index(inplace=True)

In [191]:
df

  index names  GPA  GPA_100
0     A    PJ  4.0    100.0
1     B    PJ  4.0    100.0
2     C    TJ  3.8     95.0
3     D    MJ  3.5     87.5

## 5. Data import and export

In [194]:
# reading from CSV file
df = pd.read_csv('GDP.csv')   # reading excel files: pd.read_excel('GDP.xlsx',sheetname='Sheet1')
df.tail(5)

           DATE        GDP
285  2018-04-01  20510.177
286  2018-07-01  20749.752
287  2018-10-01  20897.804
288  2019-01-01  21098.827
289  2019-04-01  21339.121

In [196]:
# Writing to CSV file
df.to_csv('GDP_new.csv',index=False)   # writing to excel files: df.to_excel('GDP.xlsx',sheet_name='raw data')

In [198]:
df.to_excel('GDP.xlsx',sheet_name='raw data', index=False)